app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
    def index
        challenges = Challenge.all

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        challenge = Challenge.find(params[:id])