app/controllers/challenge_answers_controller.rb

    def create
        game = Game.find_by_username(params[:game_username])
        challenge_answer = game.challenge_answers.build(challenge_answer_params)
        challenge_answer.save
---
SELECT "games".* FROM "games" WHERE "games"."username" = ? LIMIT ?  [["username", "undefined"], ["LIMIT", 1]]
INSERT INTO "challenge_answers" ("created_at", "updated_at", "challenge_id", "face_id", "game_id", "correct") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2021-05-14 02:20:32.460059"], ["updated_at", "2021-05-14 02:20:32.460059"], ["challenge_id", 1], ["face_id", 6], ["game_id", 1], ["correct", 1]]

    def show
        game = Game.find_by_username(params[:game_username])
        challenge_answer = ChallengeAnswer.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."username" = ? LIMIT ?  [["username", "Ronda"], ["LIMIT", 1]]
SELECT "challenge_answers".* FROM "challenge_answers" WHERE "challenge_answers"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]