app/models/challenge_answer.rb

    def advance_challenge
        game.current_challenge_id += 1
        game.save
---
UPDATE "games" SET "current_challenge_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["current_challenge_id", 2], ["updated_at", "2021-05-20 01:23:31.843534"], ["id", 3]]